In [2]:
import pandas as pd
import numpy as np

In [2]:
#genel olarak dataframes alıcaz fakat seri oluşturmayıda öğrenelim

In [3]:
seri = pd.Series([2,4,6,8,10])
seri

0     2
1     4
2     6
3     8
4    10
dtype: int64

In [4]:
type(seri)

pandas.core.series.Series

In [5]:
seri.axes

[RangeIndex(start=0, stop=5, step=1)]

In [6]:
seri.dtype

dtype('int64')

In [7]:
seri.ndim

1

In [8]:
seri.size

5

In [9]:
seri.head(3)

0    2
1    4
2    6
dtype: int64

In [10]:
seri.tail(3)

2     6
3     8
4    10
dtype: int64

In [11]:
seri2 = pd.Series([2,4,6,8,10],index = ["a","b","c","d","e"])

In [12]:
seri2

a     2
b     4
c     6
d     8
e    10
dtype: int64

In [13]:
seri2["a"]

2

In [14]:
seri2["a":"c"]

a    2
b    4
c    6
dtype: int64

In [15]:
seri = pd.Series({"a":10, "b":15, "c":11}) 
seri

a    10
b    15
c    11
dtype: int64

In [16]:
list(seri.items())

[('a', 10), ('b', 15), ('c', 11)]

In [17]:
"a" in seri

True

In [18]:
"t" in seri

False

In [19]:
seri[["a","c"]]#fancy index

a    10
c    11
dtype: int64

In [20]:
#PANDAS DATAFRAME 1.bölüm basic creation burdan sonra pycharm a yaz

In [21]:
pd.DataFrame([1,5,9,4,1], columns = ["Deger"])

   Deger
0      1
1      5
2      9
3      4
4      1

In [3]:
dictionary = {"PDP": [1, 5, 81, 3, 1],
              "EFT": [15, 18, 25, 53, 32],
              "CGC": [1980, 2341, 2553, 800, 15400]}

In [4]:
df1 = pd.DataFrame(dictionary,index = ("t","f","g","a","ı"))
df1

   PDP  EFT    CGC
t    1   15   1980
f    5   18   2341
g   81   25   2553
a    3   53    800
ı    1   32  15400

In [24]:
df1.head()

   PDP  EFT    CGC
t    1   15   1980
f    5   18   2341
g   81   25   2553
a    3   53    800
ı    1   32  15400

In [25]:
df1.tail()

   PDP  EFT    CGC
t    1   15   1980
f    5   18   2341
g   81   25   2553
a    3   53    800
ı    1   32  15400

In [26]:
df1.columns=("DPDP","DEFT","DCGC")

In [27]:
df1

   DPDP  DEFT   DCGC
t     1    15   1980
f     5    18   2341
g    81    25   2553
a     3    53    800
ı     1    32  15400

In [28]:
df1.index=["a","b","c","d","e"]
df1

   DPDP  DEFT   DCGC
a     1    15   1980
b     5    18   2341
c    81    25   2553
d     3    53    800
e     1    32  15400

In [29]:
df1.axes

[Index(['a', 'b', 'c', 'd', 'e'], dtype='object'),
 Index(['DPDP', 'DEFT', 'DCGC'], dtype='object')]

In [30]:
df1.shape

(5, 3)

In [31]:
df1.info

<bound method DataFrame.info of    DPDP  DEFT   DCGC
a     1    15   1980
b     5    18   2341
c    81    25   2553
d     3    53    800
e     1    32  15400>

In [32]:
df1.values #numpy arraydir

array([[    1,    15,  1980],
       [    5,    18,  2341],
       [   81,    25,  2553],
       [    3,    53,   800],
       [    1,    32, 15400]], dtype=int64)

In [6]:
df1

   PDP  EFT    CGC
t    1   15   1980
f    5   18   2341
g   81   25   2553
a    3   53    800
ı    1   32  15400

In [5]:
df1.describe().T

     count    mean          std    min     25%     50%     75%      max
PDP    5.0    18.2    35.145412    1.0     1.0     3.0     5.0     81.0
EFT    5.0    28.6    15.142655   15.0    18.0    25.0    32.0     53.0
CGC    5.0  4614.8  6067.054368  800.0  1980.0  2341.0  2553.0  15400.0

In [34]:
df1["DPDP"]

a     1
b     5
c    81
d     3
e     1
Name: DPDP, dtype: int64

In [35]:
df1.DPDP

a     1
b     5
c    81
d     3
e     1
Name: DPDP, dtype: int64

In [36]:
a = np.array([1,2,3,4,5])

In [37]:
pd.DataFrame(a, columns=["deg1"])

   deg1
0     1
1     2
2     3
3     4
4     5

In [38]:
df1["NEW_Feature"] = [-25, -8, -1998, 3, -5]
df1

   DPDP  DEFT   DCGC  NEW_Feature
a     1    15   1980          -25
b     5    18   2341           -8
c    81    25   2553        -1998
d     3    53    800            3
e     1    32  15400           -5

In [8]:
df = pd.DataFrame([[1, 2], [4, 5], [7, 8]],
     index=['cobra', 'viper', 'sidewinder'],
     columns=['max_speed', 'shield'])
df

            max_speed  shield
cobra               1       2
viper               4       5
sidewinder          7       8

In [40]:
#index operations

In [10]:
s1 = np.random.randint(10, size = 5)
s2 = np.random.randint(10, size = 5)
s3 = np.random.randint(10, size = 5)

In [11]:
dictionary = {"var1" : s1,"var2" : s2,"var3" : s3} 
dictionary

{'var1': array([7, 7, 0, 4, 5]),
 'var2': array([1, 9, 7, 7, 7]),
 'var3': array([9, 1, 4, 9, 7])}

In [12]:
df = pd.DataFrame(dictionary)
df

   var1  var2  var3
0     7     1     9
1     7     9     1
2     0     7     4
3     4     7     9
4     5     7     7

In [17]:
df[0:2]

   var1  var2  var3
0     7     1     9
1     7     9     1

In [45]:
df.index = ["a","b","c","d","e"]
df

   var1  var2  var3
a     2     6     5
b     8     4     6
c     0     1     2
d     1     3     9
e     3     1     2

In [46]:
df.drop("a",axis = 0)#satır olarak a indexli verileri siler

   var1  var2  var3
b     8     4     6
c     0     1     2
d     1     3     9
e     3     1     2

In [47]:
df#ana veri setinin üstünden silinmiyor

   var1  var2  var3
a     2     6     5
b     8     4     6
c     0     1     2
d     1     3     9
e     3     1     2

In [48]:
df.drop("a",axis = 0,inplace = True)#kalıcı olarak siler sık kullanılır

In [49]:
df

   var1  var2  var3
b     8     4     6
c     0     1     2
d     1     3     9
e     3     1     2

In [50]:
ortalama = df.var3.mean()
ortalama
df

   var1  var2  var3
b     8     4     6
c     0     1     2
d     1     3     9
e     3     1     2

In [51]:
liste = list()
for i in df.var3:
    if(ortalama > i):
        liste.append("Düsük")
    else:
        liste.append("Yüksek")
df["bilgi"] = liste
df

   var1  var2  var3   bilgi
b     8     4     6  Yüksek
c     0     1     2   Düsük
d     1     3     9  Yüksek
e     3     1     2   Düsük

In [52]:
df.var3[0]

6

In [53]:
df.index.size

4

In [54]:
l=["c","e"]
df.drop(l,axis = 0)

   var1  var2  var3   bilgi
b     8     4     6  Yüksek
d     1     3     9  Yüksek

In [55]:
df

   var1  var2  var3   bilgi
b     8     4     6  Yüksek
c     0     1     2   Düsük
d     1     3     9  Yüksek
e     3     1     2   Düsük

In [56]:
l=["var1","var2","var4"]

In [57]:
for i in l:
    print(i in df)

True
True
False

In [58]:
df["var4"] = df["var1"] * df["var2"]

In [59]:
df

   var1  var2  var3   bilgi  var4
b     8     4     6  Yüksek    32
c     0     1     2   Düsük     0
d     1     3     9  Yüksek     3
e     3     1     2   Düsük     3

In [60]:
df.drop("var4",axis = 1,inplace = True)

In [61]:
df

   var1  var2  var3   bilgi
b     8     4     6  Yüksek
c     0     1     2   Düsük
d     1     3     9  Yüksek
e     3     1     2   Düsük

In [62]:
#Gözlem ve Değişken Seçimi : loc & iloc

In [19]:
m = np.random.randint(1,30,size = (10,3))
df = pd.DataFrame(m, columns = ["var1","var2","var3"])
df

   var1  var2  var3
0    13     5    20
1    18    17    26
2    12    29    22
3    13    27    24
4     3    10    28
5    27    11    13
6     7    14    25
7     7     6     4
8    22    12    28
9    10    23    21

In [20]:
#loc:tanımlandığı şekli ile seçim yapmak için kullanılır

In [21]:
df.loc[0:3]

   var1  var2  var3
0    13     5    20
1    18    17    26
2    12    29    22
3    13    27    24

In [22]:
#iloc: alışık olduğumuz indexleme mantığı ile seçim yapar

In [23]:
df.iloc[0:3]

   var1  var2  var3
0    13     5    20
1    18    17    26
2    12    29    22

In [1]:
df.iloc[:,:2]

NameError: name 'df' is not defined

In [25]:
df.loc[0:3, "var3"]#index tabanlı arama için loc kullanılır

0    20
1    26
2    22
3    24
Name: var3, dtype: int32

In [26]:
df.iloc[0:3, "var3"]#iloc işleminde index tabanlı arama yapılamaz

ValueError: Location based indexing can only have [integer, integer slice (START point is INCLUDED, END point is EXCLUDED), listlike of integers, boolean array] types

In [45]:
df

   var1  var2  var3
0    13     5    20
1    18    17    26
2    12    29    22
3    13    27    24
4     3    10    28
5    27    11    13
6     7    14    25
7     7     6     4
8    22    12    28
9    10    23    21

In [27]:
df.iloc[0:3]["var3"]#bu şekilde kullanılır

0    20
1    26
2    22
Name: var3, dtype: int32

In [28]:
#Koşullu Eleman İşlemleri

In [29]:
df["var1"][0:2]

0    13
1    18
Name: var1, dtype: int32

In [30]:
df[df.var1 > 15]

   var1  var2  var3
1    18    17    26
5    27    11    13
8    22    12    28

In [47]:
df[(df.var1 > 15) & (df.var2 > 12)]

   var1  var2  var3
1    18    17    26

In [32]:
df.loc[(df.var1 >15),["var1","var2"]]

   var1  var2
1    18    17
5    27    11
8    22    12

In [33]:
df[df.var1 > 15][["var1","var2"]]

   var1  var2
1    18    17
5    27    11
8    22    12

In [34]:
#Birleştirme (Join) İşlemleri

In [35]:
a = np.random.randint(1,30, size = (5,3))
df1 = pd.DataFrame(a,columns=["var1","var2","var3"])
df2 = df1 + 99
df2

   var1  var2  var3
0   105   100   103
1   110   119   126
2   113   106   113
3   104   101   104
4   119   122   116

In [36]:
pd.concat([df1,df2])

   var1  var2  var3
0     6     1     4
1    11    20    27
2    14     7    14
3     5     2     5
4    20    23    17
0   105   100   103
1   110   119   126
2   113   106   113
3   104   101   104
4   119   122   116

In [37]:
pd.concat([df1,df2],ignore_index = True)

   var1  var2  var3
0     6     1     4
1    11    20    27
2    14     7    14
3     5     2     5
4    20    23    17
5   105   100   103
6   110   119   126
7   113   106   113
8   104   101   104
9   119   122   116

In [38]:
df2.columns = ["var1","var2","deg3"]
df2

   var1  var2  deg3
0   105   100   103
1   110   119   126
2   113   106   113
3   104   101   104
4   119   122   116

In [39]:
pd.concat([df1,df2])#mantıksız hatalı birleştirme

   var1  var2  var3   deg3
0     6     1   4.0    NaN
1    11    20  27.0    NaN
2    14     7  14.0    NaN
3     5     2   5.0    NaN
4    20    23  17.0    NaN
0   105   100   NaN  103.0
1   110   119   NaN  126.0
2   113   106   NaN  113.0
3   104   101   NaN  104.0
4   119   122   NaN  116.0

In [40]:
pd.concat([df1,df2], join = "inner")

   var1  var2
0     6     1
1    11    20
2    14     7
3     5     2
4    20    23
0   105   100
1   110   119
2   113   106
3   104   101
4   119   122

In [41]:
pd.concat([df1,df2], join_axes = [df1.columns])

TypeError: concat() got an unexpected keyword argument 'join_axes'

In [42]:
?pd.concat

Signature:
pd.concat(
    objs: Union[Iterable[~FrameOrSeries], Mapping[Union[Hashable, NoneType], ~FrameOrSeries]],
    axis=0,
    join='outer',
    ignore_index: bool = False,
    keys=None,
    levels=None,
    names=None,
    verify_integrity: bool = False,
    sort: bool = False,
    copy: bool = True,
) -> Union[ForwardRef('DataFrame'), ForwardRef('Series')]
Docstring:
Concatenate pandas objects along a particular axis with optional set logic
along the other axes.

Can also add a layer of hierarchical indexing on the concatenation axis,
which may be useful if the labels are the same (or overlapping) on
the passed axis number.

Parameters
----------
objs : a sequence or mapping of Series or DataFrame objects
    If a mapping is passed, the sorted keys will be used as the `keys`
    argument, unless it is passed, in which case the values will be
    selected (see below). Any None objects will be dropped silently unless
    they are all None in which case a ValueError will be raised.
axis : {0/'index', 1/'columns'}, default 0
    The axis to concatenate along.
join : {'inner', 'outer'}, default 'outer'
    How to handle indexes on other axis (or axes).
ignore_index : bool, default False
    If True, do not use the index values along the concatenation axis. The
    resulting axis will be labeled 0, ..., n - 1. This is useful if you are
    concatenating objects where the concatenation axis does not have
    meaningful indexing information. Note the index values on the other
    axes are still respected in the join.
keys : sequence, default None
    If multiple levels passed, should contain tuples. Construct
    hierarchical index using the passed keys as the outermost level.
levels : list of sequences, default None
    Specific levels (unique values) to use for constructing a
    MultiIndex. Otherwise they will be inferred from the keys.
names : list, default None
    Names for the levels in the resulting hierarchical index.
verify_integrity : bool, default False
    Check whether the new concatenated axis contains duplicates. This can
    be very expensive relative to the actual data concatenation.
sort : bool, default False
    Sort non-concatenation axis if it is not already aligned when `join`
    is 'outer'.
    This has no effect when ``join='inner'``, which already preserves
    the order of the non-concatenation axis.

    .. versionadded:: 0.23.0
    .. versionchanged:: 1.0.0

       Changed to not sort by default.

copy : bool, default True
    If False, do not copy data unnecessarily.

Returns
-------
object, type of objs
    When concatenating all ``Series`` along the index (axis=0), a
    ``Series`` is returned. When ``objs`` contains at least one
    ``DataFrame``, a ``DataFrame`` is returned. When concatenating along
    the columns (axis=1), a ``DataFrame`` is returned.

See Also
--------
Series.append : Concatenate Series.
DataFrame.append : Concatenate DataFrames.
DataFrame.join : Join DataFrames using indexes.
DataFrame.merge : Merge DataFrames by indexes or columns.

Notes
-----
The keys, levels, and names arguments are all optional.

A walkthrough of how this method fits in with other tools for combining
pandas objects can be found `here
<https://pandas.pydata.org/pandas-docs/stable/user_guide/merging.html>`__.

Examples
--------
Combine two ``Series``.

>>> s1 = pd.Series(['a', 'b'])
>>> s2 = pd.Series(['c', 'd'])
>>> pd.concat([s1, s2])
0    a
1    b
0    c
1    d
dtype: object

Clear the existing index and reset it in the result
by setting the ``ignore_index`` option to ``True``.

>>> pd.concat([s1, s2], ignore_index=True)
0    a
1    b
2    c
3    d
dtype: object

Add a hierarchical index at the outermost level of
the data with the ``keys`` option.

>>> pd.concat([s1, s2], keys=['s1', 's2'])
s1  0    a
    1    b
s2  0    c
    1    d
dtype: object

Label the index keys you create with the ``names`` option.

>>> pd.concat([s1, s2], keys=['s1', 's2'],
...           names=['Series name', 'Row ID'])
Series name  Row ID
s1           0         a
             1         b
s2           0         c
             1         d
dtype: object

Combine two ``DataFrame`` objects with identical columns.

>>> df1 = pd.DataFrame([['a', 1], ['b', 2]],
...                    columns=['letter', 'number'])
>>> df1
  letter  number
0      a       1
1      b       2
>>> df2 = pd.DataFrame([['c', 3], ['d', 4]],
...                    columns=['letter', 'number'])
>>> df2
  letter  number
0      c       3
1      d       4
>>> pd.concat([df1, df2])
  letter  number
0      a       1
1      b       2
0      c       3
1      d       4

Combine ``DataFrame`` objects with overlapping columns
and return everything. Columns outside the intersection will
be filled with ``NaN`` values.

>>> df3 = pd.DataFrame([['c', 3, 'cat'], ['d', 4, 'dog']],
...                    columns=['letter', 'number', 'animal'])
>>> df3
  letter  number animal
0      c       3    cat
1      d       4    dog
>>> pd.concat([df1, df3], sort=False)
  letter  number animal
0      a       1    NaN
1      b       2    NaN
0      c       3    cat
1      d       4    dog

Combine ``DataFrame`` objects with overlapping columns
and return only those that are shared by passing ``inner`` to
the ``join`` keyword argument.

>>> pd.concat([df1, df3], join="inner")
  letter  number
0      a       1
1      b       2
0      c       3
1      d       4

Combine ``DataFrame`` objects horizontally along the x axis by
passing in ``axis=1``.

>>> df4 = pd.DataFrame([['bird', 'polly'], ['monkey', 'george']],
...                    columns=['animal', 'name'])
>>> pd.concat([df1, df4], axis=1)
  letter  number  animal    name
0      a       1    bird   polly
1      b       2  monkey  george

Prevent the result from including duplicate index values with the
``verify_integrity`` option.

>>> df5 = pd.DataFrame([1], index=['a'])
>>> df5
   0
a  1
>>> df6 = pd.DataFrame([2], index=['a'])
>>> df6
   0
a  2
>>> pd.concat([df5, df6], verify_integrity=True)
Traceback (most recent call last):
    ...
ValueError: Indexes have overlapping values: ['a']
File:      c:\anaconda3\lib\site-packages\pandas\core\reshape\concat.py
Type:      function

In [43]:
#İleri Birleştirme İşlemleri

In [44]:
#birebir birleştirme

In [71]:
df3 = pd.DataFrame({'calisanlar':['Ali','Veli','Ayse','Fatma'],
                    'grup':['Muhasebe','Muhendislik','Muhendislik','İK']})
df3

  calisanlar         grup
0        Ali     Muhasebe
1       Veli  Muhendislik
2       Ayse  Muhendislik
3      Fatma           İK

In [72]:
df4 = pd.DataFrame({'calisanlar':['Ayse','Ali','Veli','Fatma'],
                    'ilk_giris':[2010,2009,2014,2019]})
df4

  calisanlar  ilk_giris
0       Ayse       2010
1        Ali       2009
2       Veli       2014
3      Fatma       2019

In [73]:
pd.merge(df3,df4)#benzer olanı karşısına yerleştirir

  calisanlar         grup  ilk_giris
0        Ali     Muhasebe       2009
1       Veli  Muhendislik       2014
2       Ayse  Muhendislik       2010
3      Fatma           İK       2019

In [74]:
pd.merge(df3,df4, on = "calisanlar")#belirtme şekli birden fazla benzerlik varsa

  calisanlar         grup  ilk_giris
0        Ali     Muhasebe       2009
1       Veli  Muhendislik       2014
2       Ayse  Muhendislik       2010
3      Fatma           İK       2019

In [75]:
#çoktan teke

In [76]:
df5 = pd.merge(df3,df4)
df5

  calisanlar         grup  ilk_giris
0        Ali     Muhasebe       2009
1       Veli  Muhendislik       2014
2       Ayse  Muhendislik       2010
3      Fatma           İK       2019

In [77]:
df6 = pd.DataFrame({'grup':['Muhasebe','Muhendislik','İK'],
                   'mudur':['Caner','Mustafa','Berkcan']})
df6

          grup    mudur
0     Muhasebe    Caner
1  Muhendislik  Mustafa
2           İK  Berkcan

In [78]:
pd.merge(df5,df6)

  calisanlar         grup  ilk_giris    mudur
0        Ali     Muhasebe       2009    Caner
1       Veli  Muhendislik       2014  Mustafa
2       Ayse  Muhendislik       2010  Mustafa
3      Fatma           İK       2019  Berkcan

In [79]:
#çoktan çoka

In [80]:
df7 = pd.DataFrame({'grup':['Muhasebe','Muhasebe','Muhendislik','Muhendislik','İK','İK'],
                    'yetenekler':['matematik','excel','kodlama','linux','excel','yonetim']})
df7

          grup yetenekler
0     Muhasebe  matematik
1     Muhasebe      excel
2  Muhendislik    kodlama
3  Muhendislik      linux
4           İK      excel
5           İK    yonetim

In [81]:
df3

  calisanlar         grup
0        Ali     Muhasebe
1       Veli  Muhendislik
2       Ayse  Muhendislik
3      Fatma           İK

In [82]:
pd.merge(df3,df7)

  calisanlar         grup yetenekler
0        Ali     Muhasebe  matematik
1        Ali     Muhasebe      excel
2       Veli  Muhendislik    kodlama
3       Veli  Muhendislik      linux
4       Ayse  Muhendislik    kodlama
5       Ayse  Muhendislik      linux
6      Fatma           İK      excel
7      Fatma           İK    yonetim

In [83]:
#Toplulaştırma ve Gruplama (Aggregation & Grouping)

In [50]:
import seaborn as sns

In [85]:
?sns.load_dataset

Signature: sns.load_dataset(name, cache=True, data_home=None, **kws)
Docstring:
Load an example dataset from the online repository (requires internet).

This function provides quick access to a small number of example datasets
that are useful for documenting seaborn or generating reproducible examples
for bug reports. It is not necessary for normal usage.

Note that some of the datasets have a small amount of preprocessing applied
to define a proper ordering for categorical variables.

Use :func:`get_dataset_names` to see a list of available datasets.

Parameters
----------
name : str
    Name of the dataset (``{name}.csv`` on
    https://github.com/mwaskom/seaborn-data).
cache : boolean, optional
    If True, try to load from the local cache first, and save to the cache
    if a download is required.
data_home : string, optional
    The directory in which to cache data; see :func:`get_data_home`.
kws : keys and values, optional
    Additional keyword arguments are passed to passed through to
    :func:`pandas.read_csv`.

Returns
-------
df : :class:`pandas.DataFrame`
    Tabular data, possibly with some preprocessing applied.
File:      c:\anaconda3\lib\site-packages\seaborn\utils.py
Type:      function

In [86]:
df = sns.load_dataset("planets")
df.head()

            method  number  orbital_period   mass  distance  year
0  Radial Velocity       1         269.300   7.10     77.40  2006
1  Radial Velocity       1         874.774   2.21     56.95  2008
2  Radial Velocity       1         763.000   2.60     19.84  2011
3  Radial Velocity       1         326.030  19.40    110.62  2007
4  Radial Velocity       1         516.220  10.50    119.47  2009

In [87]:
df.shape

(1035, 6)

In [88]:
df.mean()

number               1.785507
orbital_period    2002.917596
mass                 2.638161
distance           264.069282
year              2009.070531
dtype: float64

In [89]:
df["mass"].mean()

2.6381605847953216

In [90]:
df["mass"].count()

513

In [91]:
df["mass"].min()

0.0036

In [92]:
df["mass"].max()

25.0

In [93]:
df["mass"].sum()#toplamları

1353.37638

In [94]:
df["mass"].std()#standart sapma

3.8186166509616046

In [95]:
df["mass"].var()#varyans

14.58183312700122

In [96]:
df.describe().T

,count,mean,std,min,25%,50%,75%,max
number,1035.0,1.785507,1.240976,1.000000,1.00000,1.0000,2.000,7.0
orbital_period,992.0,2002.917596,26014.728304,0.090706,5.44254,39.9795,526.005,730000.0
mass,513.0,2.638161,3.818617,0.003600,0.22900,1.2600,3.040,25.0
distance,808.0,264.069282,733.116493,1.350000,32.56000,55.2500,178.500,8500.0
year,1035.0,2009.070531,3.972567,1989.000000,2007.00000,2010.0000,2012.000,2014.0

In [97]:
df.dropna().describe().T#eksikler varsa eksik olanları siler

,count,mean,std,min,25%,50%,75%,max
number,498.0,1.734940,1.175720,1.0000,1.00000,1.000,2.0000,6.0
orbital_period,498.0,835.778671,1469.128259,1.3283,38.27225,357.000,999.6000,17337.5
mass,498.0,2.509320,3.636274,0.0036,0.21250,1.245,2.8675,25.0
distance,498.0,52.068213,46.596041,1.3500,24.49750,39.940,59.3325,354.0
year,498.0,2007.377510,4.167284,1989.0000,2005.00000,2009.000,2011.0000,2014.0

In [98]:
#Gruplama İşlemleri

In [99]:
df = pd.DataFrame({'gruplar':['A','B','C','A','B','C'],
                   'veri':[10,11,52,23,43,55]}, columns = ['gruplar','veri'])
df

  gruplar  veri
0       A    10
1       B    11
2       C    52
3       A    23
4       B    43
5       C    55

In [100]:
df.groupby("gruplar")#toplulaştırma fonk

In [101]:
df.groupby("gruplar").mean()

         veri
gruplar
A        16.5
B        27.0
C        53.5

In [102]:
planetdf = sns.load_dataset("planets")
planetdf.head()

            method  number  orbital_period   mass  distance  year
0  Radial Velocity       1         269.300   7.10     77.40  2006
1  Radial Velocity       1         874.774   2.21     56.95  2008
2  Radial Velocity       1         763.000   2.60     19.84  2011
3  Radial Velocity       1         326.030  19.40    110.62  2007
4  Radial Velocity       1         516.220  10.50    119.47  2009

In [103]:
planetdf.groupby("method")["orbital_period"]

In [104]:
planetdf.groupby("method")["orbital_period"].mean()

method
Astrometry                          631.180000
Eclipse Timing Variations          4751.644444
Imaging                          118247.737500
Microlensing                       3153.571429
Orbital Brightness Modulation         0.709307
Pulsar Timing                      7343.021201
Pulsation Timing Variations        1170.000000
Radial Velocity                     823.354680
Transit                              21.102073
Transit Timing Variations            79.783500
Name: orbital_period, dtype: float64

In [105]:
planetdf.groupby("method")["mass"].std()

method
Astrometry                            NaN
Eclipse Timing Variations        1.308148
Imaging                               NaN
Microlensing                          NaN
Orbital Brightness Modulation         NaN
Pulsar Timing                         NaN
Pulsation Timing Variations           NaN
Radial Velocity                  3.825883
Transit                               NaN
Transit Timing Variations             NaN
Name: mass, dtype: float64

In [106]:
#Aggregate (ileri toplulaştırma işlemleri 1) önemli

In [107]:
df = pd.DataFrame({'gruplar':['A','B','C','A','B','C'],
                   'degisken1':[10,23,33,22,11,99],
                   'degisken2':[100,253,33,262,111,969]}, columns = ['gruplar','degisken1','degisken2'])
df

  gruplar  degisken1  degisken2
0       A         10        100
1       B         23        253
2       C         33         33
3       A         22        262
4       B         11        111
5       C         99        969

In [108]:
df.groupby("gruplar").aggregate(["min","max",np.median])

        degisken1            degisken2
              min max median       min  max median
gruplar
A              10  22     16       100  262    181
B              11  23     17       111  253    182
C              33  99     66        33  969    501

In [109]:
df.groupby("gruplar").aggregate({"degisken1":["min","max",np.median],"degisken2":"mean"})

        degisken1            degisken2
              min max median      mean
gruplar
A              10  22     16       181
B              11  23     17       182
C              33  99     66       501

In [110]:
#Filter

In [111]:
df

  gruplar  degisken1  degisken2
0       A         10        100
1       B         23        253
2       C         33         33
3       A         22        262
4       B         11        111
5       C         99        969

In [112]:
def filter_func(x):
    return x["degisken1"].std() > 9

In [113]:
df.groupby("gruplar").std()

         degisken1   degisken2
gruplar
A         8.485281  114.551299
B         8.485281  100.409163
C        46.669048  661.851947

In [114]:
df.groupby("gruplar").filter(filter_func)#belirlediğimiz kısıtı yollarız ve sorgulatır

  gruplar  degisken1  degisken2
2       C         33         33
5       C         99        969

In [115]:
#Transform

In [116]:
df["degisken1"]*9

0     90
1    207
2    297
3    198
4     99
5    891
Name: degisken1, dtype: int64

In [117]:
df_a = df.iloc[:,1:3]

In [118]:
df_a.transform(lambda x: (x-x.mean()) / x.std())#standart normal dönüşümdür

   degisken1  degisken2
0  -0.687871  -0.543907
1  -0.299074  -0.101259
2   0.000000  -0.737746
3  -0.328982  -0.075221
4  -0.657963  -0.512083
5   1.973890   1.970217

In [119]:
df

  gruplar  degisken1  degisken2
0       A         10        100
1       B         23        253
2       C         33         33
3       A         22        262
4       B         11        111
5       C         99        969

In [120]:
df.groupby("gruplar").transform(lambda x: (x-x.mean()) / x.std())#?

   degisken1  degisken2
0  -0.707107  -0.707107
1   0.707107   0.707107
2  -0.707107  -0.707107
3   0.707107   0.707107
4  -0.707107  -0.707107
5   0.707107   0.707107

In [121]:
#Apply

In [122]:
df_a.apply(np.sum)

degisken1     198
degisken2    1728
dtype: int64

In [123]:
df.groupby("gruplar").apply(np.sum)

        gruplar  degisken1  degisken2
gruplar
A            AA         32        362
B            BB         34        364
C            CC        132       1002

In [124]:
#Pivot Tablolar

In [51]:
titanic = sns.load_dataset("titanic")

In [52]:
titanic.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [127]:
titanic.groupby("sex")["survived"].mean()

sex
female    0.742038
male      0.188908
Name: survived, dtype: float64

In [128]:
titanic.groupby("sex")[["survived"]].mean()

        survived
sex
female  0.742038
male    0.188908

In [57]:
titanic.groupby(["sex","class"])[["survived"]].aggregate("mean")#kurtulma durumlarını tablolarız

               survived
sex    class
female First   0.968085
       Second  0.921053
       Third   0.500000
male   First   0.368852
       Second  0.157407
       Third   0.135447

In [58]:
titanic.groupby(["sex","class"])[["survived"]].aggregate("mean").unstack()#düzenler

        survived
class     First     Second    Third
sex
female  0.968085  0.921053  0.500000
male    0.368852  0.157407  0.135447

In [131]:
#pivot ile table kolay yol

In [132]:
titanic.pivot_table("survived",index = "sex", columns = "class")

class     First     Second    Third
sex
female  0.968085  0.921053  0.500000
male    0.368852  0.157407  0.135447

In [133]:
titanic.age.head()

0    22.0
1    38.0
2    26.0
3    35.0
4    35.0
Name: age, dtype: float64

In [134]:
age = pd.cut(titanic["age"],[0,18,45,90])#kategorik değişkenlere bölme
age.head(10)

0    (18.0, 45.0]
1    (18.0, 45.0]
2    (18.0, 45.0]
3    (18.0, 45.0]
4    (18.0, 45.0]
5             NaN
6    (45.0, 90.0]
7     (0.0, 18.0]
8    (18.0, 45.0]
9     (0.0, 18.0]
Name: age, dtype: category
Categories (3, interval[int64]): [(0, 18] < (18, 45] < (45, 90]]

In [135]:
titanic.pivot_table("survived",index = ["sex",age], columns = "class")

class              First     Second    Third
sex    age
female (0, 18]   0.909091  1.000000  0.511628
       (18, 45]  0.981481  0.905660  0.428571
       (45, 90]  0.950000  0.857143  0.333333
male   (0, 18]   0.800000  0.600000  0.215686
       (18, 45]  0.462963  0.073529  0.144385
       (45, 90]  0.261905  0.062500  0.000000

In [136]:
#Dış Kaynaklı Veri Okuma

In [137]:
#csv okuma
pd.read_csv("reading_data/ornekcsv.csv")#bu şekilde gelirse ayırma işlemi yaparız

       a;b;c
0    78;12;1
1    78;12;2
2   78;324;3
3      7;2;4
4    88;23;5
5       6;2;
6    56;11;6
7     7;12;7
8    56;21;7
9    346;2;8
10     5;1;8
11  456;21;8
12   3;12;88

In [138]:
pd.read_csv("reading_data/ornekcsv.csv",sep = ";")

      a    b     c
0    78   12   1.0
1    78   12   2.0
2    78  324   3.0
3     7    2   4.0
4    88   23   5.0
5     6    2   NaN
6    56   11   6.0
7     7   12   7.0
8    56   21   7.0
9   346    2   8.0
10    5    1   8.0
11  456   21   8.0
12    3   12  88.0

In [139]:
#txt okuma
pd.read_csv("reading_data/duz_metin.txt")#ön tanımlı metnine bakarız öntanımlı metin boşluk ve virgüldür

    1 2
0   2 2
1   3 2
2   4 2
3   5 2
4   6 2
5  7 2
6   8 2
7   9 2
8  10 2

In [140]:
df = pd.read_excel("reading_data/ornekx.xlsx")

In [141]:
df.head()

    a    b    c
0  78   12  1.0
1  78   12  2.0
2  78  324  3.0
3   7    2  4.0
4  88   23  5.0

In [142]:
df.columns = ("A","B","C")

In [143]:
df

      A    B     C
0    78   12   1.0
1    78   12   2.0
2    78  324   3.0
3     7    2   4.0
4    88   23   5.0
5     6    2   NaN
6    56   11   6.0
7     7   12   7.0
8    56   21   7.0
9   346    2   8.0
10    5    1   8.0
11  456   21   8.0
12    3   12  88.0

In [144]:
tips = pd.read_csv("reading_data/tips.txt")

In [145]:
tips.head()

   total_bill   tip     sex smoker  day    time  size
0       16.99  1.01  Female     No  Sun  Dinner     2
1       10.34  1.66    Male     No  Sun  Dinner     3
2       21.01  3.50    Male     No  Sun  Dinner     3
3       23.68  3.31    Male     No  Sun  Dinner     2
4       24.59  3.61  Female     No  Sun  Dinner     4

In [146]:
tips.pivot_table("tip",index = "sex", columns = ["day"])

day          Fri       Sat       Sun      Thur
sex
Female  2.781111  2.801786  3.367222  2.575625
Male    2.693000  3.083898  3.220345  2.980333

In [147]:
#Doküman Okuma Kültürü - yüzde 95 yapısal problemler veri işlemedir

In [148]:
9/0

ZeroDivisionError: division by zero

In [149]:
#https://stackoverflow.com/ üzerinde araştır